app/views/users/show.html.erb

SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 1]]
---
</div>
<% @user.polls.each do |poll| %>

SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ? AND "votes"."vote" = ?  [["poll_id", 1], ["vote", 1]]
---
  </h2><br>
  <% if Vote.all.where(poll_id: poll.id).count > 0 %>
  <%= green = (((Vote.all.where(poll_id: poll.id, vote: true).count).to_f/(Vote.all.where(poll_id: poll.id).count).to_f)*100).round %>%