app/views/users/show.html.erb


    <% logged_in_user = User.find(current_user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]