app/views/polls/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% @user = User.find(current_user.id) %>

SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ? AND "votes"."vote" = ?  [["poll_id", 1], ["vote", 0]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 7]]
---

        <% if Vote.all.where(poll_id: poll.id).count > 0 %>
          <% red = (((Vote.all.where(poll_id: poll.id, vote: true).count).to_f/(Vote.all.where(poll_id: poll.id).count).to_f)*100).round %>

SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ? AND "votes"."vote" = ?  [["poll_id", 1], ["vote", 0]]
---
          <br>
          <%= poll.votes.where(vote: true).count %>  -  <%=  poll.votes.where(vote: false).count%>