app/views/polls/new.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
<% @user = User.find(current_user.id) %>

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %>
    <%= collection_select(:poll, :user_id, User.all, :id, :username) %><br>