app/views/polls/show.html.erb

  </h2><br>
  <% if Vote.all.where(poll_id: @poll.id).count > 0 %>
  <%= green = (((Vote.all.where(poll_id: @poll.id, vote: true).count).to_f/(Vote.all.where(poll_id: @poll.id).count).to_f)*100).round %>%
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 3]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ? AND "votes"."vote" = ?  [["poll_id", 3], ["vote", 1]]