app/views/followers/index.html.erb

<div class="box">
  <% @user = User.find(current_user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

    <br>
    <% @user.followers.each do |f| %>
---
SELECT "followers".* FROM "followers" WHERE (followed_id = 4)