app/controllers/polls_controller.rb

  def show
    @poll = Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @poll = Poll.create(poll_params)
    creating_user = User.find_by(username: current_user.username)
    current_score = creating_user.score
    if creating_user.user_type == 'free'
      creating_user.update(score: (current_score - 10))
---
INSERT INTO "polls" ("user_id", "question", "answer_one", "answer_two", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Flatiron"], ["LIMIT", 1]]
UPDATE "users" SET "score" = ?, "user_type" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", -33], ["user_type", "free"], ["updated_at", "2019-03-26 10:00:04.346974"], ["id", 4]]