app/controllers/votes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Fez"], ["LIMIT", 1]]
INSERT INTO "votes" ("poll_id", "user_id", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["poll_id", 3], ["user_id", 1], ["vote", 0], ["created_at", "2019-03-25 16:57:38.755526"], ["updated_at", "2019-03-25 16:57:38.755526"]]
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", -23], ["updated_at", "2019-03-26 09:56:44.658721"], ["id", 4]]
---
  def create
    voting_user = User.find_by(username: current_user.username)
    @vote = Vote.create(user_id: voting_user.id, poll_id: params[:poll_id].to_i, vote: params[:button])



    voted_on_poll_id = params[:poll_id].to_i
    poll_user_id = Poll.find(voted_on_poll_id).user_id
    poll_creator = User.find_by(id: poll_user_id)


    voter_current_score = voting_user.score
    creator_current_score = poll_creator.score

    voting_user.update(score: (voter_current_score + 2))